Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: ཐམས་ཅད་དུ་སེམས་ཅང་ཤེས་པ་དང་། ཐམས་ཅད་དུ་ཤེས་བཞིན་དང་ལྡན་པ་དང་།
en: It is to be discriminating and alert in all situations.

source: སེམས་ཕྱིན་ཅི་མ་ལོག་པ་དང་། སེམས་དྲི་མ་མེད་ཅིང་འོད་གསལ་བ་དང་།
en: It is to have a mind that is unerring, stainless, and luminous.

source: རྟག་ཏུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་རབ་ཏུ་བརྩོན་པ་དང་། བརྩོན་པ་མི་འདོར་བ་དང་།
en: It is to be constant and steady in the perfections and to not give up that effort.

source: རྟག་ཏུ་དགེ་བ་གང་ཡིན་ཚོལ་ཞིང་ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་ཆུད་མི་གཟོན་པ་དང་།
en: It is to know what virtue is and not squander the Dharma that one has heard.

source: གཞན་དག་ལ་ཡང་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དང་། སེམས་ཟང་ཟིང་མེད་པ་དང་།
en: It is to teach others correctly while being free of material concerns.

source: རྟག་ཏུ་དབང་པོ་བསྡམས་པ་དང་། རྟག་ཏུ་སེམས་མཉམ་པར་བཞག་པ་དང་།
en: It to keep one’s senses restrained and one’s mind settled.

source: མྱ་ངན་ལས་འདས་པ་ལ་གཞོལ་བ་དང་། འཁོར་བ་མི་གཏོང་བ་དང་། རྙེད་པ་དང་མ་རྙེད་པ་དང་། གྲགས་པ་དང་།
en: It is to be inclined toward nirvāṇa, but not abandon saṃsāra.

source: མ་གྲགས་པ་དང་། བསྟོད་པ་དང་། སྨད་པ་དང་། བདེ་བ་དང་། སྡུག་བསྔལ་གྱིས་མི་སྒུལ་བ་དང་།
en: It is to not be disturbed by success and failure, fame and infamy, praise and blame, or happiness and suffering.

source: ཐམས་ཅད་དུ་ཚོད་ཤེས་པ་དང་། ཐམས་ཅད་དུ་དྲན་པ་ཉེ་བར་གཞོག་པ་དང་།
en: It is to know what is appropriate in any given context and to always apply mindfulness.

source: སྦྱིན་པས་ལོངས་སྤྱོད་ཆེ་བ་དང་།
en: “It is to have great wealth through generosity.

source: ཚུལ་ཁྲིམས་ཀྱིས་ལྷ་དང་མིར་སྐྱེ་བ་དང་།
en: It is to be born among gods and humans through discipline.

source: བཟོད་པས་མཛེས་པ་དང་།
en: It is to be beautiful due to patience.

source: བརྩོན་འགྲུས་ཀྱིས་ཉོན་མོངས་པ་ཡོངས་སུ་འདོར་བ་དང་།
en: It is to transcend the afflictive emotions through diligence.

source: བསམ་གཏན་རྣམས་ཀྱིས་སེམས་ལས་སུ་རུང་བ་དང་།
en: It is to make the mind pliable through the stages of meditative stability.

source: ཤེས་རབ་ཀྱིས་འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་རབ་ཏུ་རྟོག་པ་དང་།
en: It is to discriminate between worldly and transcendent phenomena through insight.

source: བསྡུ་བའི་དངོས་པོ་རྣམས་ཀྱིས་ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་།
en: “It is to be irreproachable because of using the means of attracting disciples.

source: ཚངས་པའི་གནས་པ་རྣམས་ཀྱིས་དུལ་བ་དང་།
en: It is to be restrained through the brahmā states.

source: བདེན་པ་དང་། གཏོང་བ་དང་། ཉེ་བར་ཞི་བ་དང་། ཤེས་རབ་ཀྱི་བྱིན་གྱི་རླབས་རྣམས་ཀྱིས་སེམས་ཤིན་ཏུ་དུལ་བ་དང་།
en: It is to have strong control of the mind because of being empowered by truth, magnanimity, tranquility, and insight.

source: བསམ་གཏན་རྣམས་ཀྱིས་སེམས་ཡིད་དུ་འོང་བ་དང་། ཏིང་ངེ་འཛིན་རྣམས་ཀྱིས་ཟབ་པ་དང་།
en: It is to have a mind inspired through the stages of meditative stability and experience the profound through the samādhis.

source: འཕགས་པའི་བདེན་པ་རྣམས་ཀྱིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པ་དང་།
en: It is to correctly understand what is genuine and correct through the truths of the noble ones.

source: སྟོང་པ་ཉིད་སྒོམ་པས་ལྟ་བ་དང་བྲལ་བ་དང་། མཚན་མ་མེད་པ་སྒོམ་པས་རྣམ་པར་མི་རྟོག་པ་དང་། སྨོན་པ་མེད་པ་སྒོམ་པས་ཡོངས་སུ་འཛིན་པ་མེད་པ་དང་།
en: It is to be free of views through the cultivation of emptiness, be nonconceptual through the cultivation of signlessness, and be free of grasping through the cultivation of wishlessness.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་སྒོམ་པས་ཐེག་པ་ཆེན་པོ་རྟོགས་པར་ཁོང་དུ་ཆུད་པ་དང་།
en: It is to master the Great Vehicle through cultivation of the perfections.

source: ཐབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་གཏོད་པ་དང་།
en: It is to orient oneself toward omniscient wisdom through the perfection of skillful means.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པོ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་སྐོང་བ་དང་།
en: It is to master the conduct of a bodhisattva through the ten bodhisattva levels.

source: དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་ཚོལ་བས་ཡོན་ཏན་ཐམས་ཅད་སྐྱེ་བའི་སྒོ་དང་།
en: It is to find the gateway to engendering all qualities by seeking out a spiritual friend.

source: སློབ་དཔོན་དང་། མཁན་པོ་དང་། བླ་མ་ལ་སྲི་ཞུ་བྱེད་པས་སངས་རྒྱས་ཐམས་ཅད་མཉེས་པར་བྱེད་པ་དང་།
en: It is to serve all buddhas by being attentive to one’s teacher, preceptor, and master.

source: རང་གི་ལུས་དང་སེམས་ཡོངས་སུ་ཤེས་པས་ཐམས་ཅད་ཤེས་པ་ཉིད་དང་།
en: It is the state of knowing everything because of knowing one’s own body and mind.

source: ང་རྒྱལ་མེད་པས་གཟི་བརྗིད་དང་ལྡན་པ་དང་།
en: “It is to be majestic because of being free of pride.

source: སེམས་ཅན་ཐམས་ཅད་ལ་འདུད་ཅིང་ཕྱག་འཚལ་བས་སྤྱི་གཙུག་བལྟར་མི་མཐོང་བ་དང་།
en: It is to have an invisible uṣṇīṣa because of bowing to and revering all beings.

source: ཆོ་མ་ཆོ་དགུ་བྱིན་པས་མཚན་ཡོངས་སུ་རྫོགས་པ་དང་།
en: It is to perfect the major marks through giving away all manner of things.

source: སེམས་ཅན་ཐམས་ཅད་དང་འཐུན་པར་འཇུག་པས་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པ་དང་།
en: It is to perfect the minor marks by acting harmoniously with all beings.

source: ཐེག་པ་ཆེན་པོ་ཡང་དག་པར་རབ་ཏུ་སྟོན་པས་ཅང་ཤེས་པའི་ས་དང་།
en: It is to achieve the state of refinement by clearly explaining the Great Vehicle.

source: བྱང་ཆུབ་ཀྱི་སེམས་ཡང་དག་པར་རབ་ཏུ་སྟོན་པས་ཕྱིར་མི་ལྡོག་པའི་ས་དང་།
en: It is to attain the state of irreversibility through clearly teaching about the mind set on awakening.

source: སྟོང་པ་ཉིད་རབ་ཏུ་སྟོན་པས་བག་ཆགས་ཡང་དག་པར་འཇོམས་པ་དང་།
en: It is to overcome all habitual patterns by teaching about emptiness.

source: ཆོས་བྱིན་པས་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་དང་།
en: It is to attain correct discernment through giving the Dharma.

source: དྲན་པ་རབ་ཏུ་བྱིན་པས་གཟུངས་ཐོབ་པ་དང་།
en: It is to attain dhāraṇī through giving the gift of recollection.

source: ཆོས་ཁོང་དུ་ཆུད་པས་སྤོབས་པ་ཐོབ་པ་དང་།
en: It is to attain confident eloquence through understanding the Dharma.

source: སྤོབས་པ་ཉེ་བར་སྒྲུབ་པས་ཕྱད་པར་ལུང་སྟོན་པ་དང་།
en: It is to be unrestrained in prophecy through the attainment of confident eloquence.

source: ཉམ་ཆུང་བ་རྣམས་ལ་བཟོད་པས་སྲེད་མེད་ཀྱི་བུའི་ལུས་ཐོབ་པ་དང་།
en: It is to attain the form of Nārāyaṇa through patience with those who exhibit weakness.

source: ཚུལ་ཁྲིམས་འཆལ་བ་རྣམས་ལ་བཟོད་པས་མཐོང་མ་ཐག་ཏུ་སེམས་ཅན་ཐམས་ཅད་དང་བར་འགྱུར་བ་དང་།
en: It is to bring clarity to beings the moment one is seen because of being patient with those of poor discipline.

source: གཞན་དག་གིས་གནོད་སེམས་རབ་ཏུ་ཞི་བར་བྱེད་པ་དང་། རྟག་ཏུ་མཉམ་པར་བཞག་པ་དང་། བརྩོན་འགྲུས་བརྩམས་པ་མངོན་པར་ཤེས་པར་འགྱུར་བ་དང་། ཏིང་ངེ་འཛིན་རབ་ཏུ་འབྱིན་པས་མདོམས་ཀྱི་སྦ་བ་སྦུབས་སུ་ནུབ་པ་དང་།
en: It is to have one’s private parts retracted into their sheath because of pacifying the harmful thoughts of others, remaining always in meditative composure, having a preternatural level of diligence, and giving the gift of samādhi.

source: སྤྱོད་ལམ་ཡང་དག་པར་རབ་ཏུ་བྱིན་པས་ཀུན་དུ་མཛེས་པ་དང་།
en: It is to be of exquisite beauty because of giving the gift of good conduct.

source: དགེ་བའི་བཤེས་གཉེན་ལ་སྦྱོར་བས་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་དང་འགྲོགས་པ་དང་།
en: It is to associate with buddhas, bodhisattvas, śrāvakas, and pratyekabuddhas because of one’s connection to a spiritual friend.

source: འདོད་པ་ཡོངས་སུ་གཏོང་བས་འཇིག་རྟེན་ཐམས་ཅད་ཡིད་ཆེས་པ་དང་།
en: It is to have the trust of the entire world due to forsaking desire.

source: ཁྲོ་བ་ཡོངས་སུ་འདོར་བས་འཇིག་རྟེན་ཐམས་ཅད་དགའ་བ་དང་།
en: It is to be the delight of the entire world because of rejecting anger.

source: ཕྲག་དོག་ཡོངས་སུ་འདོར་བས་རྙེད་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་གྲགས་པའི་མཆོག་དང་།
en: It is to have great fame and the greatest wealth because of rejecting jealousy.

source: གནས་བྱིན་པས་འཇིག་རྟེན་ཐམས་ཅད་རྟོན་པ་དང་།
en: It is to be a pillar for the entire world because of being a giver of support.

source: རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་རབ་ཏུ་བྱིན་པས་ཆོས་ལ་རབ་ཏུ་དགའ་བ་དང་།
en: It is to be renowned and to delight in the Dharma because of giving the gift of wealth, respect, and praise.

source: གྲགས་པའི་སྒྲ་དང་། གསོང་པོར་སྨྲ་བས་ངག་ཡོངས་སུ་དག་པ་དང་།
en: “It is to be pure in speech because of speaking sincerely.

source: སྙན་པར་སྨྲ་བས་ཚངས་པའི་སྒྲ་དང་།
en: It is to have the voice of Brahmā because of speaking pleasantly.

source: འཇམ་པོར་སྨྲ་བས་བྱ་ཀ་ལ་པིང་ཀའི་སྒྲ་སྐད་དང་།
en: It is to have a voice like a kalaviṅka bird because of speaking sweetly.

source: ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་ཀྱིས་འཇིག་རྟེན་ཐམས་ཅད་དུ་གྲགས་པ་དང་།
en: It is to achieve fame throughout the world through a lack of hostility.

source: སེམས་ཅན་ཐམས་ཅད་ལ་མི་སླུ་བས་དཔང་གཅིག་པོར་འགྱུར་བ་དང་།
en: It is to be a singular witness because of not deceiving any being.

source: ལྟུང་བ་མི་གླེང་བས་མངལ་གྱི་གནས་ལས་ཡང་དག་པར་འདའ་བ་དང་།
en: It is to transcend womb birth because of not making accusations of moral failing.

source: སྲོག་གཅོད་པ་སྤོང་བས་ཚེ་དཔག་ཏུ་མེད་པ་དང་།
en: It is to have a limitless lifespan because of forsaking killing.

source: རྐུན་པོ་ཡོངས་སུ་སྤོང་བས་ནམ་མཁའི་མཛོད་དང་།
en: It is to possess the sky treasury because of forsaking theft.

source: སྡུག་པའི་དངོས་པོ་ཡོངས་སུ་གཏོང་བས་ལག་ན་རིན་པོ་ཆེ་དང་།
en: It is to have the jewel-in-hand because of giving away beloved possessions.

source: བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བས་ལོངས་སྤྱོད་མི་ཟད་པ་དང་།
en: It is to have never-ending pleasure because of being dedicated to awakening.

source: འདོད་པས་ལོག་པར་གཡེམ་པ་ཡོངས་སུ་སྤོང་བས་སྐྱེས་བུ་ཆེན་པོ་དང་།
en: It is to be a great being because of forsaking inappropriate sexual desires.

source: བརྫུན་དུ་སྨྲ་བ་ཡོངས་སུ་སྤོང་བས་ངག་གི་གསང་བ་ཐོབ་པ་དང་།
en: It is to attain the secret of speech because of forsaking the telling of lies.

source: ཕྲ་མ་ཡོངས་སུ་སྤོང་བས་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་སྟོན་པ་དང་།
en: It is to be a teacher to the entire world because of forsaking slander.

source: ངག་རྩུབ་པོ་ཡོངས་སུ་སྤོང་བས་འཇིག་རྟེན་གྱིས་བསྟོད་པའི་སྣོད་དང་།
en: It is to be worthy of the world’s praise because of forsaking harsh speech.

source: ཚིག་ཀྱལ་པ་མི་སྨྲ་བས་གཡོག་མི་ཕྱེད་པ་དང་།
en: It is to have loyal attendants because of forsaking meaningless speech.

source: བརྣབ་སེམས་ཡོངས་སུ་སྤོང་བས་གཏེར་ཆེན་པོ་རྙེད་པ་དང་།
en: It is to discover great treasures because of forsaking covetousness.

source: གནོད་སེམས་ཡོངས་སུ་སྤོང་བས་སྟེགས་སུ་གྱུར་པ་དང་།
en: It is to become a bridge because of forsaking malice.

source: ལོག་པར་ལྟ་བ་ཡོངས་སུ་སྤོང་བས་འཇིག་རྟེན་ཐམས་ཅད་རྟོན་པ་དང་།
en: It is to be a support for the entire world because of forsaking wrong views.

source: ཆོས་རྒྱ་ཆེན་པོ་ལ་སྤྱོད་པས་སྟོབས་བཅུ་ཉིད་དང་།
en: It is to possess the ten strengths because of being trained in the vast Dharma.

source: སྦྱིན་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བས། སངས་རྒྱས་ཀྱི་ཆོས་ཕྱིར་མི་ལྡོག་པ་ཐོབ་པ་དང་།
en: It is to attain irreversibility in the teachings of the buddhas due to not hoping for reward from acts of generosity.

source: ཀུན་དུ་འཛིན་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བས། མི་འཇིགས་པ་ཐོབ་པ་སྟེ།
en: And it is to attain fearlessness because of forsaking all grasping.

source: རིགས་ཀྱི་བུ་ངས་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་བྱང་ཆུབ་སེམས་དཔའི་ཆོ་ག་བསྟན་ཀྱང་མཐར་ཕྱིན་པར་མི་འགྱུར་རོ། །
en: “Child of good family, I have taught the guidelines for a bodhisattva for eons upon eons and have never reached the limit.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོ་ག་ཚད་མེད་དེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོ་ག་ཞེས་བྱའོ། །
en: The guidelines for a bodhisattva are thus infinite, but nonetheless these are known as guidelines for a bodhisattva.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་ཆོ་ག་དང་སྤྱོད་ཡུལ་ཕུན་སུམ་ཚོགས་པ་ཡིན་ནོ། །
en: Child of good family, these represent the perfect guidelines and scope for a bodhisattva.

source: དེ་ལྟར་ཆོ་ག་དང་སྤྱོད་ཡུལ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་རྙེད་པར་དཀའ་བའི་འདུ་ཤེས་ཅན་མ་ཡིན་ནོ། །
en: A bodhisattva who perfects these guidelines and this scope will not find it difficult to awaken to buddhahood.”

source: ལྷའི་བུ་བཟང་སེམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་ཤེས་བཞིན་དང་ལྡན་པ་ཞེས་བགྱི།
en: The devaputra Excellent Mind then asked, “Blessed One, in what way can bodhisattvas be described as careful?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་བུ་གང་བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་ཏིང་ངེ་འཛིན་མི་འདོར་ལ། ཏིང་ངེ་འཛིན་གྱི་དབང་གིས་ཀྱང་མི་སྐྱེ་བ་དང་། ཏིང་ངེ་འཛིན་ལས་ལོག་ནས། གང་དུ་སེམས་ཅན་གྱི་དོན་བྱ་བ་དེར་སྐྱེ་བ་སྟེ།
en: “Devaputra,” replied the Blessed One, “bodhisattvas either never give up their samādhi and do not take birth due to the power of that samādhi, or they emerge from samādhi to take birth wherever they can help beings.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་བཞིན་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: Child of good family, this is how bodhisattvas can be described as careful.”

source: ལྷའི་བུ་བཟང་སེམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དབེན་པ་ཞེས་བགྱི།
en: The devaputra Excellent Mind then asked, “Blessed One, in what way can bodhisattvas be described as isolated?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཐམས་ཅད་དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། ཆོས་ཀྱི་དབྱིངས་སུ་མཐོང་བ་དེ་སྐྱེ་བོ་མང་པོའི་ནང་དུ་སོང་ཡང་དབེན་པར་ཤེས་པར་བྱ་སྟེ།
en: “Devaputra,” replied the Blessed One, “bodhisattvas who recognize the suchness of all things, the limit of reality, and the expanse of phenomena, yet still remain among many people, will understand isolation.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དབེན་པ་ཞེས་བྱའོ། །
en: Child of good family, this is how bodhisattvas can be described as isolated.

source: གང་གཉིས་ལ་བློ་མི་འཇུག་པ་དེ་ནི་ཤིན་ཏུ་དབེན་པ་ཞེས་བྱའོ། །
en: Bodhisattvas whose minds do not function dualistically are described as extremely isolated.”

source: ལྷའི་བུ་བཟང་སེམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་བཞག་པ་ཞེས་བགྱི།
en: The devaputra Excellent Mind then asked, “In what way can bodhisattvas be described as meditatively composed?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་བུ་ནམ་བྱང་ཆུབ་སེམས་དཔའི་ཡིད་ཀྱིས་སྨོན་པ་ཐམས་ཅད་བྲལ་ཞིང་། ཆོས་གང་ཡང་གཟུང་བར་རམ། སྤང་བར་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ལ། དེ་གང་དང་གང་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་དེ་དང་དེ་སྟོང་པ་དང་།
en: “Devaputra,” replied the Blessed One, “bodhisattvas are free of all mental aspiration while still perceiving a given phenomenon; or, they do not adopt the perspective of rejection while seeing that everything they behold is emptiness and unreal.

source: ཡང་དག་པ་མ་ཡིན་པར་མཐོང་བ་སྟེ། ལྷའི་བུ་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་བཞག་པ་ཞེས་བྱའོ། །
en: Devaputra, this is how bodhisattvas can be described as meditatively composed.”

source: ལྷའི་བུ་བཟང་སེམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དུ་འགྲོ་བ་ཞེས་བགྱི།
en: The devaputra Excellent Mind then asked, “Blessed One, in what way can bodhisattva be described as omnipresent?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔས་གང་བདག་དང་སེམས་ཅན་ཐམས་ཅད་སྟོང་པ་ཉིད་དུ་མཉམ་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བའོ། །
en: “Devaputra,” replied the Blessed One, “bodhisattvas adopt the perspective that they and all other beings are equally defined by emptiness.

source: ལྷའི་བུ་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དུ་འགྲོ་བ་ཞེས་བྱའོ། །
en: Devaputra, this is how bodhisattvas can be described as omnipresent.”

source: ལྷའི་བུ་བཟང་སེམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་དུལ་བ་ཞེས་བགྱི།
en: The devaputra Excellent Mind then asked, “Blessed One, in what way can bodhisattvas be described as tamed?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་རྣམ་པར་རྟོག་པ་རྣམས་ཀྱིས་མི་འཕྲོགས་པའོ། །
en: “They do not get carried away by concepts,” replied the Blessed One.

source: ལྷའི་བུ་བཟང་སེམས་ཀྱིས་གསོལ་པ། ཇི་ལྟར་ན་ཞི་བ་ཞེས་བགྱི།
en: The devaputra Excellent Mind then asked, “Blessed One, in what way can a bodhisattva be described as at peace?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་ཀུན་ནས་ཉོན་མོངས་པར་ཡང་མི་འགྱུར། རྣམ་པར་བྱང་བར་ཡང་མི་འགྱུར་བ་དེ་ཞི་བ་ཞེས་བྱའོ། །
en: “They are at peace when they are neither defiled nor pure,” replied the Blessed One.

source: ལྷའི་བུ་བཟང་སེམས་ཀྱིས་གསོལ་པ། ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ནི་རང་གི་ཁ་ན་ལས་པ་ལགས་སོ། །
en: The devaputra Excellent Mind then said, “According to my understanding of what the Blessed One has said, the awakening of bodhisattvas depends on themselves alone.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ཇི་ལྟ་ཇི་ལྟར་ཀུན་ནས་ཉོན་མོངས་པ་ཡོངས་སུ་སྤོང་བ་དེ་ལྟ་དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་འཛིན་ཏོ། །
en: To the extent that they abandon defilements is the extent to which they maintain the qualities of a buddha.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི། གང་ནས་ཀྱང་བླང་བ་མ་ལགས། གང་དུ་ཡང་བསྐུར་བ་མ་ལགས་སོ། །
en: Blessed One, the qualities of a buddha are not something that can be received from someone or bestowed on someone.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ལ་ཡེ་ཤེས་རྣམ་པར་དག་པ་ནི་བྱང་ཆུབ་སྟེ།
en: Blessed One, among all qualities, awakening is pure wisdom.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་བཟོད་པའི་རྗེས་སུ་ཞུགས་པ་ནི་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་ལགས་སོ། །
en: Therefore, Blessed One, the conduct conducive to awakening is the pursuit of patience.

source: གང་འདི་ལྟར་འཚལ་བ་དེ་ནི། ཐམས་ཅད་མཁྱེན་པ་ལགས་སོ། །
en: “Blessed One, those who understand this are omniscient.

source: བཅོམ་ལྡན་འདས་གང་དག་མཉམ་པ་ཉིད་འདི་ལ་ཞུགས་པ་དེ་དང་དེ་དག་ནི། བཅོམ་ལྡན་འདས་སྦྱིན་པ་ཕུན་སུམ་ཚོགས་པ་ལགས་སོ། །
en: Blessed One, those who maintain this kind of equality have perfect generosity.

source: གང་དག་ཆོས་མཉམ་པ་ཉིད་འདི་ལ་སྟེན་པ་དེ་དང་དེ་དག་ནི། ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་ལགས་སོ། །
en: Those who support this kind of equality toward phenomena have perfect discipline.

source: གང་དག་ཆོས་མཉམ་པ་ཉིད་འདི་ཉིད་ལ་བཟོད་པ་དེ་དང་དེ་དག་ནི། བཟོད་པ་ཕུན་སུམ་ཚོགས་པ་ལགས་སོ། །
en: Those who accept this kind of equality toward phenomena have perfect patience.

source: གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཐོས་པ་དང་། སེམས་པ་དང་། སྒོམ་པ་ལ་བརྩོན་པ་དེ་དང་དེ་དག་ནི། བརྩོན་འགྲུས་ཕུན་སུམ་ཚོགས་པ་ལགས་སོ། །
en: Those who hear, contemplate, and cultivate this approach to the Dharma have perfect diligence.

source: གང་དག་ཆོས་མཉམ་པ་ཉིད་འདི་ལ་ངེས་པར་རྟོག་པ་དེ་དང་དེ་དག་ནི། བསམ་གཏན་ཕུན་སུམ་ཚོགས་པ་ལགས་སོ། །
en: Those who investigate this equality toward phenomena have perfect meditative stability.

source: གང་དག་ཆོས་མཉམ་པ་ཉིད་འདི་རྣམ་པར་དཔྱོད་པ་དེ་དང་དེ་དག་ནི། ཤེས་རབ་དང་ལྡན་པ་ལགས་སོ། །
en: Those who analyze this equality toward phenomena possess insight.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་གང་དད་པ་རྙེད་པ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་མཐོང་ངོ་། །
en: Blessed One, those who find faith in this approach to the Dharma see the Thus-Gone One.

source: དེ་དག་གིས་ཆོས་མངོན་སུམ་དུ་བགྱིས་སོ། །
en: They actualize the Dharma.

source: བཅོམ་ལྡན་འདས་དེ་དག་གིས་བདུད་བཏུལ་ཏོ། །
en: Blessed One, they tame Māra.

source: བཅོམ་ལྡན་འདས་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རབ་ཏུ་སྟོན་པ་དེ་དག་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་ལགས་སོ། །
en: Blessed One, those who teach this approach to the Dharma turn the wheel of Dharma of the thus-gone ones.

source: བཅོམ་ལྡན་འདས་གང་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཁོང་དུ་ཆུད་པ་དེ་དག་ཆོས་རྟོགས་པ་ལགས་སོ། །
en: Blessed One, those who master this approach to the Dharma realize the Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་བཟང་སེམས་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One then indicated his approval to the devaputra Excellent Mind by saying, “Well done!

source: བཟང་སེམས་ལེགས་སོ་ལེགས་སོ། །
en: Well done, Excellent Mind!

source: དེ་དེ་བཞིན་ནོ། །
en: That is correct.

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: What you said is correct.

source: བཟང་སེམས་གང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་བྱང་ཆུབ་ནི། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་རབ་ཏུ་བསྟན་ཏོ། །
en: Excellent Mind, the awakening of the thus-gone, blessed, completely perfect buddhas is taught through this approach to the Dharma.

source: གང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དགོངས་པ་དེ་ཐམས་ཅད་ཀྱང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་བཤད་དོ། །
en: The complete intention of all the thus-gone ones is explained through this approach to the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པར་འགྱུར་བ་དེ་དག་ནི། རྙེད་པ་ཆེན་པོ་འབྱོར་པར་འགྱུར་རོ། །
en: Bodhisattvas who hear this approach to the Dharma will find great profit.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གང་དག་གི་ལག་ཏུ་སོང་བ་དེ་དག་ནི། ཆོས་ཀྱི་གཏེར་ཆེན་པོ་ཐོབ་པར་འགྱུར་རོ། །
en: Those who hold this approach to the Dharma in their hands will have discovered a great treasure.

source: གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡོངས་སུ་འཛིན་པ་དེ་དང་དེ་དག་ནི། དེ་བཞིན་གཤེགས་པས་ཡིད་བརྟན་པའོ། །དེ་དང་དེ་དག་ནི་གསང་བ་འཛིན་པའོ། །
en: Those who uphold this approach to the Dharma will be trusted by the Thus-Gone One and will know the secret.

source: དེ་དང་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་བླ་ན་མེད་པའི་མཆོད་པས་མཆོད་པར་བྱེད་པའོ། །དེ་དག་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: They will worship the Thus-Gone One with the highest mode of worship and will uphold the sublime Dharma.

source: གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ཤིང་ཐོས་ནས་ཀྱང་མོས་པ་དེ་དང་དེ་དག་ནི་ལྷའི་བུ་ང་ལ་ལན་དུ་ཕན་འདོགས་པའོ། །
en: Those who hear this approach to the Dharma and develop interest will, devaputra, repay my kindness.

source: ལྷའི་བུ་དེ་དག་ནི་ཕྱོགས་ཐམས་ཅད་དུ་མུན་པ་མེད་པར་བྱེད་པར་འགྱུར་བའོ། །
en: Devaputra, they will rid every region of darkness.”

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་ཐམས་ཅད་ལ་བཀའ་སྩལ་པ། ཁྱེད་ལས་སུ་དག་ཕྱི་མའི་ཚེ་ཕྱི་མའི་དུས། ལྔ་བརྒྱ་པ་ཐ་མ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་སུ་སྤྲོ། དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་སྟན་ལས་ལངས་ཏེ།
en: The Blessed One then addressed the entire assembly: “Who among you will, in a future time, in the final five hundred years, have the courage to reveal this approach to the Dharma?”

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ནི་སླད་མའི་དུས་ན། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡང་དག་པར་རབ་ཏུ་བཤད་པར་སྤྲོའོ། །
en: The bodhisattva Nirārambha then rose from his seat, adjusted his robe on one shoulder, bowed to the Blessed One with joined palms, and said, “Blessed One, I have the courage to reveal this approach to the Dharma at a later time.

source: བཅོམ་ལྡན་འདས་རྩོམ་པ་མང་པོས་ནི། དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་རྔོ་མི་ཐོགས་སོ། །
en: Blessed One, those with a strong sense of engagement do not have the capacity to understand the sublime Dharma.

source: བདག་ནི་སེམས་འཛིན་པ་མ་མཆིས། རྩོམ་པ་མ་མཆིས་ཤིང་། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་སྟེ། ཟང་ཟིང་མ་མཆིས་པའི་སེམས་དང་།
en: I do not have a grasping mind, I am not engaged, and I am impartial toward all beings.

source: རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ཐམས་ཅད་ལ་རེ་བ་མ་མཆིས་པས།
en: I do not have an interest in material gain, nor do I hope for gain, respect, or any type of praise.

source: ཆོས་ཟབ་མོ་ལ་བཟོད་པ་འདི་ཡང་དག་པར་བཤད་པར་བགྱིའོ། །
en: Therefore, I will speak on this acceptance of the profound Dharma.

source: བཅོམ་ལྡན་འདས་རྙེད་པ་དང་། བཀུར་སྟི་ལ་གནས་པས་ནི། དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་རྔོ་མི་ཐོགས་པའི་སླད་དུའོ། །བཅོམ་ལྡན་འདས།
en: Blessed One, it is because those who seek gain and respect lack the capacity to understand the sublime Dharma.

source: སེམས་ཅན་གང་དག་བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་པ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཡི་གེར་འདྲི་བ་དང་། ཀློག་པ་དང་། བྲིས་ཏེ་གླེགས་བམ་དུ་བགྱིས་ནས་འཆང་བར་འགྱུར་བ་དེ་དག་ནི།
en: Blessed One, those beings who listen to this approach to the Dharma following the Blessed One’s passing into final nirvāṇa and remember it, understand it, copy it, read it aloud, or write it down, make it into a book, and keep it will know, Blessed One, that they have been authorized by the bodhisattva Nirārambha.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱི་བྱིན་གྱི་བརླབས་སུ་རིག་པར་བྱའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ལ་ལེགས་ས་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One then indicated his approval to the bodhisattva Nirārambha by saying, “Well done!

source: རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: Well done, child of good family!

source: སེམས་དེ་འདྲ་བས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་ནུས་སོ། །
en: One who has this kind of intention is capable of understanding the sublime Dharma.”

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གང་སྙིང་རྗེ་ཆེན་པོ་དང་། མ་བྲལ་བ་དེས། དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་རྔོ་ཐོགས་སོ། །
en: The bodhisattva Avalokiteśvara said, “Those who have great compassion have the capacity to understand the sublime Dharma.
